In [1]:
import numpy as np
import pandas as pd

# üìö Í≥ºÏ†ú 1: Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Basics

In [2]:
transactions = pd.read_csv('./data/retail/transactions.csv')
transactions

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [3]:
transactions.shape

(83488, 3)

In [4]:
transactions.index.max()

83487

In [5]:
transactions.dtypes

date            object
store_nbr        int64
transactions     int64
dtype: object

# üìö Í≥ºÏ†ú 2: Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÌÉêÏÉâ

In [6]:
transactions.head(10)

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922
5  2013-01-02          5          1903
6  2013-01-02          6          2143
7  2013-01-02          7          1874
8  2013-01-02          8          3250
9  2013-01-02          9          2940

In [7]:
transactions.isna()

        date  store_nbr  transactions
0      False      False         False
1      False      False         False
2      False      False         False
3      False      False         False
4      False      False         False
...      ...        ...           ...
83483  False      False         False
83484  False      False         False
83485  False      False         False
83486  False      False         False
83487  False      False         False

[83488 rows x 3 columns]

In [8]:
transactions.isna().sum(axis=0)

date            0
store_nbr       0
transactions    0
dtype: int64

In [9]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [10]:
transactions.describe()

          store_nbr  transactions
count  83488.000000  83488.000000
mean      26.939237   1694.602158
std       15.608204    963.286644
min        1.000000      5.000000
25%       13.000000   1046.000000
50%       27.000000   1393.000000
75%       40.000000   2079.000000
max       54.000000   8359.000000